#include <iostream>
#include <string>
#include "Extentionn.hpp"

using namespace std;
using namespace ext;

int main()
{
	/*
	Задание №1
	int val = 10;
	выведите адрес переменной val
	создайте указатель для хранения адреса переменной val
	сохраните адрес переменной val в созданный указатель
	выведите значение переменной val, используя указатель
	Пусть объявлены следующие переменные:
	unsigned int a = 5U;
	double b = 0.8;
	const float f = 0.5F;
	const long long ll = 123LL;
	Объявите и проинициализируйте указатели на вышеобъявленные переменные.
	Какой размер имеют объявленные указатели? Проверьте с помощью оператора sizeof
	С помощью объявленных указателей:
	увеличьте значение переменной a на 1
	присвойте переменной b значение 0.25
	выведите удвоенное значение переменной f
	выведите посчитайте остатот от деления на 10 переменной ll
	*/
	int val = 10;
	cout << &val << endl;
	int *pt = &val;
	cout << pt << endl;

	unsigned int a = 5U;
	double b = 0.8;
	const float f = 0.5F;
	const long long ll = 123LL;

	unsigned int* pta = &a;
	double* ptb = &b;
	const float* ptf = &f;
	const long long * ptll = &ll;

	cout << sizeof(pta) << endl;
	cout << sizeof(ptb) << endl;
	cout << sizeof(ptf) << endl;
	cout << sizeof(ptll) << endl;

	*pta += 1;
	*ptb = 0.25;
	cout << *ptf * 2 << endl;
	cout << *ptll % 10 << endl;
	/*
	Задание №2
	Что выведет на экран следующий код?
	Прокоментируйте каждую строку, запишите промежуточные значения переменных.
	#include <iostream>
	using namespace std;
	int main()
	{
	int t[4] = {8,4,2,1};
	int *p1 = t + 2, *p2 = p1 - 1;
	p1++;
	cout << *p1 - t[p1 - p2] << endl;
	}
	int data[] = {1,2,3,4,5};
	Объявите указатель на первый элемент массива
	С помощью цикла for и объвленного указателя выведите каждый элемент массива в консоль.
	С помощью цикла for и объвленного указателя увеличьте каждый элемент массива в 2 раза
	и посчитайте сумму получившихся элементов массива.
	Выведите полученный результат.
	*/
	int t[4] = { 8,4,2,1 }; //создание и нициализация массива
	int *p1 = t + 2, *p2 = p1 - 1; //создание двух указателей и их инициализпция p1-адрес третьего элемента массива, а p2-второго
	p1++; //смещение на четвёртый элемент
	cout << *p1 - t[p1 - p2] << endl; // 1-t[2]= 1 - 2 = -1 - ответ

	int i = 0;
	int data[] = { 1,2,3,4,5 };
	int *ptr = data;
	for (i = 0; i < 5; ++i)
	{
		cout << *ptr << " ";
		ptr += 1;
	}
	cout << endl;
	ptr = data;
	int sum = 0;
	for (i = 0; i < 5; ++i)
	{
		*ptr *= 2;
		sum += *ptr;
		ptr += 1;
	}
	cout << sum << endl;

	/*
	Заданий №3
	1.	Сгенерировать массив из 20 рандомных элементов из диапазона [-100, 100].
	2.	Объявите указатель на первый элемент массива.
	3.	С помощью цикла for и объявленного указателя выведите массив в консоль.
	4.	Используя дополнительный указатель найдите максимальный элемент массива.
	5.	Выведите его индекс и значение. (Для вывода индекса использовать арифметику указателей).
	При обходе массива использовать указатели, запрещено обращаться к элементам массива по индексам.
	*/
	int mas[20];
	for (i = 0; i < 20; ++i)
	{
		mas[i] = GetRandomValue(-100, 100);
	}
	int *ykz = mas;
	for (i = 0; i < 20; ++i)
	{
		cout << *ykz << " ";
		ykz += 1;
	}
	for (i = 0; i < 20; ++i)
	{
		if (mas[i] > *ykz)
		{
			*ykz = mas[i];
		}
}
	cout << endl;
	cout << *ykz << endl;
	/*
	Задание №4
	Пусть задан некоторый символьный массив, проинициализированный строковым литералом.
	Например const char data[] = "abcdefghijklmnopqrstuvwxyz";
	Пользователь вводит с клавиатуры один символ.
	Необходимо вывести позицию, на которой введенный пользователем символ встретился первый раз.
	Если введенного символа в строке нет вывести -1.
	Тестовые данные			Ожидаемый результат
	d				4
	z				26
	!				-1
	*/
	const char dataf[] = "abcdefghijklmnopqrstuvwxyz";
	char us;
	int tee=0;
	int j;
	cin >> us ;
	bool ex = 0;
	for(j = 0; j < 26; ++i)
	{
		if (data[j] = us)
		{
			ex = 1;
			tee = j;
		}
	}
	
	if (ex = 0)
	{
		cout << "-1";
	}
	else
	{
		cout << tee;
	}
}
