#include <iostream>

using namespace std;
int main()
{
	setlocale(LC_ALL, "");
	/* Задание 1
	Даны три натуральных числа A, B, C. Определите, существует ли треугольник с такими сторонами.
	Если треугольник существует, выведите строку Да, иначе выведите строку Нет.
	Треугольник — это три точки, не лежащие на одной прямой.
	Тестовые данные				Ожидаемый результат
	1 1 1						Да
	1 2 4						Нет
	12 7 5						Нет
	7 10 3						Нет
	4 5 8						Да
	*/
	int a = 1;
	int b = 2;
	int c = 4;
	bool isExist = (a + b > c) && (a + c > b) && (c + b > a);
	if (isExist)
	{
		cout << "Существует" << endl;
	}
	else
	{
		cout << "Не существует" << endl;
	}
	/* Задание 2
	Напишите код, правильно склоняющий существительное «рублей» следующее за указанным числительным.
	Например, для 10, следует напечатать «рублей», для 1 — «рубль», для 2 — «рубля».
	Использовать конструкцию switch.
	Тестовые данные			Ожидаемый результат
	1					рубль
	2					рубля
	10					рублей
	101					рубль
	1255					рублей
	*/
	string s;
	cin >> i;
	if (i / 10 == 1)
	{
		s = " рублей";
	}
	else
	{
		switch (i%10)
		{
		case 1:
		case 2:
		case 3:
		case 4:
			s= " рубля" ;
			break;
		case 5:
		case 6:
		case 7:
		case 8:
		case 9:
		case 0:
			s = " рублей";
			break;
		}
	}
	cout << i << s << endl;
	/* Задание 3
	В воскресенье Вася пошел в кружок робототехники и увидел там такой код управления боевым роботом:
	// исходные данные, вводятся с клавиатуры.
	// true это 1, false это 0
	bool enemyInFront;
	bool isBoss;
	int robotHealth;
	// Код Васи
	bool shouldFire = true;
	if (enemyInFront == true)
	{
	if (isBoss == true)
	{
	if (robotHealth < 50) shouldFire = false;
	if (robotHealth > 100) shouldFire = true;
	}
	}
	else
	{
	shouldFire = false;
	}
	if(shouldFire)
	{
	cout << "Fire" << endl;
	}
	Упростите код Васи, удалив избыточные условные операторы.
	Тестовые данные		Ожидаемый результат
	false false 10
	false true 60
	true false 10			Fire
	true true 10
	true true 60			Fire
	*/
	bool enemyInFront;
	cin >> enemyInFront;
	bool isBoss;
	cin >> isBoss;
	int robotHealth;
	cin >> robotHealth;
	if (enemyInFront == 1)
	{
		if (isBoss == 1 && robotHealth > 50)
		{
			cout << "Fire" << endl;
		}
		else
		{
			cout << "-" << endl;
		}
	}
	/* Задание 4
	Вы с Васей и Петей решили выбрать самые лучшие фотографии котиков в интернете.
	Для этого каждую фотографию каждый из вас оценил по стобалльной шкале.
	Естественно, тут же встал вопрос о том, как из трех оценок получить одну финальную.
	Вы опасаетесь, что каждый из вас сильно завысит оценку фотографиям своего котика.
	Поэтому было решено в качестве финальной оценки брать не среднее арифметическое, а медиану, то есть просто откинуть максимальную и минимальную оценки.
	Вася начал писать код выбора средней оценки из трех, но запутался в if - ах, и поэтому перепоручил эту задачу вам.
	Попробуйте не просто решить задачу, но и минимизировать количество проверок и максимально упростить условия проверок.
	Тестовые данные		Ожидаемый результат
	1 2 3				2
	5 5 5				5
	2 2 9				2
	1 5 5				5
	4 5 6				5
	*/
	int f;
	cin >> f;
	int s;
	cin >> s;
	int t;
	cin >> t;
	if ((f >= s && s >= t) || (f <= s && s <= t))
	{
		cout << s;
	}
	else if ((s >= f && f >= t) || (s <= f && f <= t))
	{
		cout << s;
	}
	else if ((f >= t && t >= s) || (f <= t && t <= s))
	{
		cout << s;
	}
	/* Задание 5
	Написать логику, которая проверяет возможность существования даты по введенным пользователем данных.
	Пользователь вводит данные в формате день, месяц, год.
	Тестовые данные				Ожидаемый результат
	1 1 1992					true
	30 6 1992					true
	31 7 1992					true
	31 9 1994					false
	32 1 1992					false 
	1 13 1992					false
	29 2 1993					false
	29 2 2004					true
	29 2 1900					false
	29 2 2000					true
	*/
	int day;
	cin >> day;
	int mon;
	cin >> mon;
	int ye;
	cin >> ye;
	bool vis = (ye % 400 == 0) || ((ye % 4 == 0) && (ye % 100 != 0));
	bool IsEx = !(day>31 || ((day > 28) && (mon == 2) && (vis = false)) || mon>12 || (day > 30 && mon % 2 == 0));
	if (IsEx)
	{
		cout << "true" << endl;
	}
	else
	{
		cout << "false" << endl;
	}
}
